app/controllers/mappings_controller.rb

  def create_drug_map
    DrugMap.update_records(params[:old_name], params[:new_name])
---
UPDATE `new_drugs` SET `voided` = 1 WHERE `drug_id` = 22

  def create_concept_map
    ConceptMap.update_records(params[:old_name], params[:new_name])
---
UPDATE `new_concepts` SET `voided` = 1 WHERE `concept_id` = 151